app/views/brakes/index.html.erb

      </tr>
      <% if category.products.length > 0 %>
---
SELECT `products`.* FROM `products`