app/controllers/brakes_controller.rb

      year_hash.each do |make, make_hash|
        make_hash.each do |model, model_hash|
          model_hash.each do |submodel|
            product = Product.find_or_create_by({year: year, make: make, model: model, submodel: submodel[0], product_name: "n/a"})
---
INSERT INTO `products` (`year`, `make`, `model`, `submodel`, `product_name`, `created_at`, `updated_at`) VALUES (2016, 'Acura', 'RDX', 'All', 'n/a', '2017-02-05 03:54:41', '2017-02-05 03:54:41')
SELECT  `products`.* FROM `products` WHERE `products`.`year` = 2016 AND `products`.`make` = 'Acura' AND `products`.`model` = 'RDX' AND `products`.`submodel` = 'All' AND `products`.`product_name` = 'n/a' LIMIT 1

  def brake_products
    @product = Product.find(params[:id])
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1